{
    "0": {
        "stinger": "You shouldn't even be able to score that!",
        "text": "Someone's been fiddling with the devtools in their browser me thinks... Try playing it properly, you might have some fun!",
        "image": "bad-0.jpg"
    },
    "1": {
        "stinger": "Your actions have had fatal consequences!",
        "text": "Uh oh... Unfortunately the decisions you made were fatal for AquaVolt. You provided virtually no protection against any form of cyber attack, so hackers easily found their way in. Once they were in, hackers ran wild in your systems, causing permanent physical damage. Plant workers have died, AquaVolt's CISO has been fired, and there's a high chance you'll be arrested for corporate manslaughter. AquaVolt Power has had to shut down, permanently. Only a few hours until the lights go off now... ",
        "image": "abandonedfactory-1.jpg"
    },
    "2": {
        "stinger": "The situation at AquaVolt is bad, but recoverable.",
        "text": "The choices you made have sent AquaVolt into a meltdown. The company was ill-protected against cyberattacks and so suffered huge losses, both financially and in the trust of their clients. Fortunately, the situation is recoverable, but it’ll take a long time for AquaVolt to return to regular operations.",
        "image": "canbefixed-2.jpg"
    },
    "3": {
        "stinger": "AquaVolt has suffered, but it's still business as usual.",
        "text": "You've made some good choices and some not-so-good choices. AquaVolt fell victim to a few preventable cyber attacks due to your choice to not implement appropriate preventative security measures. However, the defences you did implement protected AquaVolt from many other attacks. As you've experienced, many organisations have a very tight budget. The important thing is to detect vulnerabilities and secure them, whilst also considering the general security and ensuring regulatory compliance. It can be a very difficult situation! Fortunately for you, AquaVolt didn’t suffer too greatly, and can continue their regular operations.",
        "image": "citylights-3.jpg"
    },
    "4": {
        "stinger": "AquaVolt is in good shape!",
        "text": "Good job! Although AquaVolt fell victim to some cyber attacks, they were few and far between, and very well-handled due to your valuable foresight. Many big organisations suffer major cyber attacks, however, they are able to learn from them, and always endeavour to be more prepared for subsequent attacks.",
        "image": "okay-4.jpg"
    },
    "5": {
        "stinger": "The CISO has their eye on you for promotion!",
        "text": "Wow, you’ve done great! The decisions you made ensured that the AquaVolt plant was secure enough to handle almost any type of cyber attack. You implemented choice security measures to prevent any system intrusion, and in the event they were bypassed, your defence-in-depth ensured any damage done was minimal. A system can never be 100% secure, however, you prioritised the most important aspects of the system, and implemented well-chosen security measures in an excellently chosen order. You've already been offered a permanent security position at AquaVolt, but your career will certainly reach great heights beyond there.",
        "image": "welldone-5.jpg"
    }
}