[
    {   
        "id": 5, 
        "description": "A firewall to protect the plant from being easily accessed from the internet is vital to the security of the process."
    },
    {   
        "id": 7, 
        "description": "A firewall to protect the office from being easily accessed from the internet is vital to the security of the organisation."
    },
    {   
        "id": 2, 
        "description": "A good, well implemented Antivirus is one of the first thing that any organisation should do."
    },
    {   
        "id": 0, 
        "description": "Your staff are some of the best security assets but without training, they will be one of your worst."
    },
    {   
        "id": 1, 
        "description": "Knowing what is on your network is a great way to go. How are you supposed to protect something you don't know exists?"
    },
    {   
        "id": 4, 
        "description": "Ensuring that people can't just wander up to the plant and mess with the equipment is quite important for the integrity of the process."
    },
    {   
        "id": 9, 
        "description": "Currently all your customer information is easily accessible to any attackers or even members of staff, prehaps you should encrypt your databases."
    },
    {   
        "id": 13, 
        "description": "Your servers are easily from the internet, ensuring they are upgraded is a good way of not letting attackers get any further."
    },
    {   
        "id": 15, 
        "description": "Minimising the traffic flow between your plant, office and SIS hinders attackers greatly. Prehaps consider network segmentation."
    },
    {   
        "id": 3, 
        "description": "Network monitoring in the plant is a great way to keep on top of any atackers moving around in the network."
    },
    {   
        "id": 8, 
        "description": "Network monitoring in the office is complex but can be very fruitful in protecting the network."
    },
    {   
        "id": 10, 
        "description": "Ensuring that your PCs are fully patched and upgraded is hinders some very effective attacks."
    },
    {   
        "id": 6, 
        "description": "Making sure that there is CCTV in your office can ensure that nobody that isn't supposed to be there, isn't there."
    },
    {   
        "id": 11, 
        "description": "Ensuring that the data on your PCs is good for hiding some of your important documents from attackers."
    },
    {   
        "id": 12, 
        "description": "By upgrading your controller you can ensure that you most important asset is more protected."
    }
]